S = ''                      #пуста строка
S = "spam's"                #подвійні лапки, це те ж саме, що і одинарні
S = 's\np\ta\x00m'          #керовані послідовності
S = """...багато строк..."""#блочні строки в потрійних лапках
S = r'\temp\spam'           #неформатовані строки(без керувальних символів)
B = b'sp\xc4m'              #байтові строки
U = u'sp\u00c4m'            #unicode строки
S1 + S2                     #конкатенація
S * 3                       #повторення
S[i]                        #індекс
S[i:j]                      #зріз
len(S)                      #довжина
"a %s parrot" % kind        #вираз форматування строки
"a {0} parrot"              #метод форматування строки
    .format(kind)S.find('pa')
S.find('pa')                #строковий метод: пошук
S.rstrip()                  #видалення пробілів
S.replace('pa', 'xx')       #заміна
S.split(',')                #розбиття по розділителю
S.isdigit()                 #перевірка вмісту
S.lower()                   #перетворення регістру символів
S.endswith('spam')          #перевірка кінця
'spam'.join(strlist)        #об'єднання з розділювачом
S.encode('latin-1')         #кодування unicode
B.decode('utf-8')           #декодування unicode
for x in S: print(x)
'spam' in S                 #ітерація
[c * 2 for c in S]
map(ord, S)                 #членство
re.match('sp(.*)am', line)  #співставлення з зразком: бібліотечний модуль